<?php

$this->title = 'Национальное Агентство Капиталов';
?>
<h1 class="page-header">Национальное Агентство Капиталов</h1>
<p><strong>Эксклюзивные финансовые услуги&nbsp;КАПИТАЛОВ</strong><br/>
    <em>CAPITALOV.com&nbsp;</em><em>является одним из ведущих поставщиков инсайдерской информации для участников
        финансового рынка Европы, России и США и продолжает развивать новые бизнес-направления в интересах исключительно
        своих клиентов</em></p>

<p>+7-<strong>499-394-2-743</strong></p>



<div style="margin-bottom: 100px;">
    <h2 class="page-header">Новости</h2>

    <p style="font-size: 80%; color: #888;">1 сентября 2015 г.</p>

    <p>Ведутся разработки второй версии.</p>
</div>
